%Решение системы нелинейных уравнений методом простой итерации
%Система
%sin(x+y)-1.2x = 0.1 -> 6/5x = -0.1+sin(x+y)
%x^2+y^2 = 1 -> x = +-sqrt(-y^2 - 1) или x^2 = -1*y^2 - 1
%Найденные производные для Якобиана
%dfs1x = cos(x+y) - (6/5);
%dfs1y = cos(x+y);
%dfs2x = 2*x;
%dfs2y = 2*y;
%f1 = sin(x+y)-1.2*x - 0.1;
%f2 = x.^2+y.^2 - 1;

% Метод простой итерации
% Система:
% sin(x+y) - 1.2*x = 0.1
% x^2 + y^2 = 1

clc;

% Начальные значения (полученные с графика)
x0 = -0.8;
y0 = -0.5;


% Выражения φ1 и φ2
%phi1 = @(y) -sqrt(1 - y.^2);              % x = φ1(y)
%phi2 = @(x) asin(1.2*x + 0.1) - x;        % y = φ2(x)

% Первая итерация
x = -sqrt(1 - y(y0).^2);
y = -asin(1.2*x(x0)+0.1) - x(x0);

%x = phi1(y0);
%y = phi2(x0);

e = 0.01;    % точность
k = 0;       % счётчик итераций

% Цикл метода простой итерации
while ( abs(x - x0) > e ) || ( abs(y - y0) > e )
    x0 = x;
    y0 = y;

    x = x(y0);
    y = y(x0);

    k = k + 1;
    if k > 100
        disp('Метод расходится');
        break;
    end
end

% Вывод
fprintf("\nКоличество итераций: %d\n", k);
fprintf("Решение:\n");
fprintf("x = %.4f\n", x);
fprintf("y = %.4f\n", y);

