#include <iostream>
#include <string>
#include <regex>

/*
Время должно быть представлено в форме hh:mm:ss, где hh - число из двух цифр от 00 до 23, mm и ss - числа из двух цифр от 00 до 59.
Ввод содержит одну или более строк длиной не более 100 символов.
Для каждой строки ввода вывести YES, если строка является записью времени, иначе вывести NO.

Пример ввода
00:00:01
0:00:01
01/12/21
23:00:00
Time is 01:00:50

Пример вывода
YES
NO
NO
YES
NO
*/

/*
int main(){
    std::string s;
    std::regex pattern(R"(([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9])");

    while (getline(std::cin, s)){
        if (std::regex_match(s, pattern)){
            std::cout << "YES" << '\n';
        }else {
            std::cout << "NO" << '\n';
        }
    }
    return 0;
}*/

/*
Алфавит марсианского языка состоит из строчных латинских букв. Буквам a, e, i, o, u, y соответствуют гласные звуки, остальным – согласные.
В результате опроса марсиан выяснилось, что им трудно произносить слова, в которых присутствуют два или более гласных звука подряд. Марсианскими лингвистами было принято решение: во всех словах, где есть два или более гласных звука подряд, оставить только последний из них.
Марсиане просят написать программу, переводящую слова из старого в новый форматы.
Например, если старое слово имело вид eeaaeeuinfaormaaiatoyuaoics, то новое слово будет таким: informatics.
Формат входного файла
Во входном файле содержится марсианское слово старого формата.
Формат выходного файла
Выходной файл должен содержать марсианское слово нового формата.
Ограничения
Длина слова находится в диапазоне от 1 до 100 символов.

Пример ввода 1
eeaaeeuinfaormaaiatoyuaoics
Пример вывода 1
informatics

Пример ввода 2
aeeaaayyaaauaaiaaiaacm
Пример вывода 2
acm

Пример ввода 3
bzzt
Пример вывода 3
bzzt
*/

/*
int main(){
    std::string s;
    std::cin >> s;
    std::regex pattern(R"(([aeiouy]){2,})");
    std::cout << std::regex_replace(s, pattern, "$1");
    return 0;
}
*/

#include <iostream>
#include <string>
#include <regex>

int main() {
std::string s;
std::regex digit("[0-9]");
int w = 0, n= 0;

while (std::cin >> s) {
if (regex_search(s, digit))
++n;
else
++w;
}

std::cout << w << " word(s), " << n << " number(s)";
}