/*
Лабораторная работа 2. Простейшие классы. Обработка исключений.

Каждый разрабатываемый класс должен, как правило, содержать следующие элементы:
скрытые поля, конструкторы с параметрами и без параметров, методы, свойства.
Методы и свойства должны обеспечивать непротиворечивый, полный, минимальный и удобный интерфейс класса.
При возникновении ошибок должны выбрасываться исключения.
Написать программу, демонстрирующую все разработанные элементы класса.
В программе должна выполняться проверка всех разработанных элементов класса.

Вариант 19
Описать класс ≪процессор≫, содержащий сведения о марке, тактовой частоте, объеме кэша и стоимости.
Предусмотреть инициализацию с проверкой допустимости значений полей.
В случае недопустимых значений полей выбрасываются исключения.
Описать свойства для получения состояния объекта.
Описать класс «материнская плата», включающий класс «процессор» (как ссылку) и объем установленной оперативной памяти.
Предусмотреть инициализацию с проверкой допустимости значений поля объема памяти.
В случае недопустимых значений поля выбрасывается исключение.
Описать свойства дляполучения состояния объекта.

Исключения придумать свои
*/

public class Main {
    public static void main(String[] args) {

    }
}