using System;

namespace MyApp // Note: actual namespace depends on the project name.
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}

/*
 Базовые приницы (3 кита) 5 китов:
1) Всякая сущность - обхект
2) Классифмкация (Класс) и Абстрагирование
3) Инкапсуляция (1 КИТ)
4) Наследование (2 КИТ)
5) Полиморфизмы (3 КИТ)
*/

/*
 ООП - эволюция
1) Неструктурное (двоичный код) с 40 до 60-ых
2) Структурное (процедурное) - типы данных, управляющие конструкции (следование, ветвления и циклы), подпрограммы (процедуры и функции)
   Были созданы самые сложные программы -> ОС | первая UNIX созданная на языке С.
   С 60-ых годов началось структурное программирование
3) В 80-ых Объектно-ориентированное программирование (ООП)
*/

/*
 Преимущества ООП:
 1) Повышение модульности и удобства повторного использования - ускорение разработки ПО.
 2) Программный код пишется в ТЕРМИНАХ предметной области и упрощает чтение кода.
*/