-- [
-- Ввод содержит одну строку текста длиной не более 100 символов.
-- Вывести введенную строку в обратном порядке.
-- 
-- Пример ввода
-- А роза упала на лапу Азора.
-- Вывод для примера
-- .арозА упал ан алапу азор А
-- ]

local txt = io.read()
print(txt:reverse())

-- [
-- После случайной генерации поля для игры необходимо определить его характеристики: количество связей между клетками по стороне и количество связей между клетками по вершинам.
-- Напишите программу для выполнения этой задачи.
-- Первая строка ввода содержит два целых числа – количество строк R ( 1 ≤ R ≤ 1000 ) и количество столбцов C (1 ≤ C ≤ 1000). 
-- Следующие R строк содержат C целых чисел 0 или 1 – сгенерированное поле (1 означает обычную клетку, 0 – препятствие).
-- Вывести два целых числа - количество связей между обычными клетками по стороне и количество связей между обычными клетками по вершинам.

-- Пример ввода
-- 5 5
-- 1 0 0 1 0
-- 0 1 1 0 1
-- 0 1 0 1 1
-- 1 0 1 1 1
-- 0 1 1 1 1
-- Пример вывода
-- 14 17
-- ]

local function myf(a, b)
    local m = {}
    for i = 1, a do 
        m[i] = {}
        for j = 1, b do
            local num = io.read("*n")
            m[i][j] = num
        end
    end
    return m
end

local a = io.read("*n")
local b = io.read("*n")
local m = myf(a, b)

local V = 0
local S = 0

for i = 1, a do
    for j = 1, b do
        if m[i][j] == 1 then
            if j < b and m[i][j+1] == 1 then
                S = S + 1
            end
            if i < a and m[i+1][j] == 1 then
                S = S + 1
            end
            if i < a and j < b and m[i+1][j+1] == 1 then
                V = V + 1
            end
            if i < a and j > 1 and m[i+1][j-1] == 1 then
                V = V + 1
            end
        end
    end
end

print(S, V)
