%Вариант 4%
%1)Вычислить значение выражения
% Числитель: 5^e × √(cos(1.88) + e^(-tg(3π/8)))
a = (5^exp(1)) * sqrt(cos(1.88)) + exp(-1*tan(3*pi/8));

% Знаменатель: log₈88 + (ch(8π/5))^(3/8)
b = log(88)/log(8) + (cosh(8*pi/5))^(3/8);

r = a / b;
%fprintf('Результат: %.6f\n', r);
%disp(r);

%2)Вычислить матрицу D: D =(A+B)*C^2* (A-B)^T

A = [4 3 1; 3 4 -5; 6 -8 9];
B = [0 2 -3; -4 8 9; 4 5 6];
C = [2 -3 -1; 3 2 0; 1 2 5];
D = (A + B) * (C^2) * (A-B)';
%disp(D);

%3)Решить систему линейных уравнений
%Вспоминаем линейную алгебру

A = [2, 2, -1;
     2, 1, -7;
     1, 3, -5];
 
B = [3;
     1;
     -2];

% Решаем систему AX = B
X = A \ B;

%fprintf('Решение системы:\n');
%fprintf('x = %.4f\n', X(1));
%fprintf('y = %.4f\n', X(2));
%fprintf('z = %.4f\n', X(3));

%4)Построить график функции, подписать оси, название графика, нанести
%сетку: y = pi^x*(3*x+1)*sin(2*x)

x = -3:0.01:3;

y = (pi.^x).*(3*x+1).*sin(2*x);

figure;
plot(x,y,'r-', 'LineWidth',1.5);
xline(0, 'k-');
yline(0, 'k-');

title('График функции y = pi^x*(3*x+1)*sin(2*x)', 'FontSize', 14);

xlabel('x', 'LineWidth', 12);
ylabel('y', 'LineWidth', 12);

grid on;
set(gca, 'GridLineStyle', '--', 'GridAlpha', 0.7);

%5)Построить график функции двух переменных, подписать оси, назавние
%графика, z = -1*exp(y^2)*(1-2*x)*y*sin(pi*x)

x = -5:0.1:5;
y = -5:0.1:5;
[X, Y] = meshgrid(x, y);

Z = -1*exp(y.^2).*(1 - 2*X) + Y + sin(X);

% Создаем 3D график поверхности
figure;
surf(X, Y, Z);
shading interp;
colormap jet;

title('График функции: z = (1 - 2x) + y + sin(x)', 'FontSize', 14);
xlabel('x', 'FontSize', 12);
ylabel('y', 'FontSize', 12);
zlabel('z', 'FontSize', 12);
colorbar; % Добавляем шкалу цветов
grid on;
box on;

%6)Составить файл-программу (или файл-функцию) для вычисления значения
%функциив в любой её точке: f(x) = дальше система из 3 уравнений